src/config/Reports/ЗадолженностьДиаграмма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>ЗадолженностьДиаграмма</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетДиаграмма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНеавтоматизированнойТорговойТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоПрессФормам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Reports/ЗадолженностьДиаграмма/Ext/ObjectModule.bsl
Перем ВидЗадолженности;

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	Если ЗначениеНеЗаполнено(ВидЗадолженности) Тогда
		Если Найти(ОбщийОтчет.мНазваниеОтчета, "Дебиторская")>0 Тогда
			ВидЗадолженности = "Дебиторская";
		ИначеЕсли найти(ОбщийОтчет.мНазваниеОтчета, "Кредиторская")>0 Тогда
			ВидЗадолженности = "Кредиторская";
		Иначе
			Сообщить("Не задан тип задолженности (переменная объекта мНазваниеОтчета)", СтатусСообщения.ОченьВажное);
			возврат;
		КонецЕсли;
	КонецЕсли;

	Если ВидЗадолженности="Дебиторская" Тогда

		ТекстРесурсы = "
		|	СУММА(СуммаОстаток) КАК Сумма ";
	ИначеЕсли ВидЗадолженности="Кредиторская" Тогда

		ТекстРесурсы = "
		|	СУММА(-СуммаОстаток) КАК Сумма ";
	Иначе

		Возврат;
		
	КонецЕсли;
	
	Текст =
	"ВЫБРАТЬ " + ТекстРесурсы + "
	|{ВЫБРАТЬ "+ТекстРесурсы+",
	|	ДоговорКонтрагента.Владелец.* КАК Контрагент,
	|	ДоговорКонтрагента.* КАК ДоговорКонтрагента,
	|	ДоговорКонтрагента.ВалютаВзаиморасчетов.* КАК ДоговорКонтрагентаВалютаВзаиморасчетов,
	|	Сделка.* КАК Сделка
	|	//СВОЙСТВА
	|}
	|ИЗ 
	//РегистрНакопления.КонтрагентыВзаиморасчетыКомпании.Остатки(&ДатаКон) КАК ТаблицаРегистра
	|(ВЫБРАТЬ
	|	ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР КОГДА Сделка = НЕОПРЕДЕЛЕНО ТОГДА ДоговорКонтрагента
	|	ИНАЧЕ Сделка КОНЕЦ КАК Сделка,
	|	СУММА (СуммаВзаиморасчетовОстаток*КурсыВалют.Курс/КурсыВалют.Кратность/КурсВалютыУпрУчета.Курс*КурсВалютыУпрУчета.Кратность) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаКон) КАК ТаблицаРегистра
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон) КАК КурсыВалют
	|	ПО КурсыВалют.Валюта = ТаблицаРегистра.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|	, РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, Валюта = &ВалютаУправленческогоУчета) КАК КурсВалютыУпрУчета
	|СГРУППИРОВАТЬ ПО
	|	ДоговорКонтрагента, Сделка
	|";
	Если ВидЗадолженности="Дебиторская" Тогда

		Текст = Текст + "
		|ИМЕЮЩИЕ СУММА (СуммаВзаиморасчетовОстаток*КурсыВалют.Курс/КурсыВалют.Кратность/КурсВалютыУпрУчета.Курс*КурсВалютыУпрУчета.Кратность)>0 ";

	ИначеЕсли ВидЗадолженности="Кредиторская" Тогда

		Текст = Текст + "
		|ИМЕЮЩИЕ СУММА (-СуммаВзаиморасчетовОстаток*КурсыВалют.Курс/КурсыВалют.Кратность/КурсВалютыУпрУчета.Курс*КурсВалютыУпрУчета.Кратность)>0 ";

	КонецЕсли; 
	Текст = Текст + "
	|) КАК ТаблицаЗадолженности
	|	//СОЕДИНЕНИЯ
	| ";

	Текст = Текст + "
	|{ГДЕ 
	|	ДоговорКонтрагента.Владелец.* КАК Контрагент,
	|	ДоговорКонтрагента.ВидВзаиморасчетов КАК ВидВзаиморасчетов,
	|	ДоговорКонтрагента.* КАК ДоговорКонтрагента,
	|	ДоговорКонтрагента.ВалютаВзаиморасчетов.* КАК ДоговорКонтрагентаВалютаВзаиморасчетов,
	|	Сделка.* КАК Сделка
	|	//СВОЙСТВА
	|	//КАТЕГОРИИ
	|}
	|{УПОРЯДОЧИТЬ ПО 
	|	ДоговорКонтрагента.Владелец.* КАК Контрагент,
	|	ДоговорКонтрагента.* КАК ДоговорКонтрагента,
	|	ДоговорКонтрагента.ВалютаВзаиморасчетов.* КАК ДоговорКонтрагентаВалютаВзаиморасчетов,
	|	Сделка.* КАК Сделка,
	|	Сумма	
	|	//СВОЙСТВА
	|}
	|{ИТОГИ ПО 
	|	ДоговорКонтрагента.Владелец.* КАК Контрагент,
	|	ДоговорКонтрагента.* КАК ДоговорКонтрагента,
	|	ДоговорКонтрагента.ВалютаВзаиморасчетов.* КАК ДоговорКонтрагентаВалютаВзаиморасчетов,
	|	Сделка.* КАК Сделка
	|	//СВОЙСТВА
	|}
	|ИТОГИ  
	|	СУММА(Сумма) 
	|ПО ОБЩИЕ 
	|АВТОУПОРЯДОЧИВАНИЕ ";

	//ОбщийОтчет.ПостроительОтчета.Текст = Текст;
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ВалютаУправленческогоУчета", КОнстанты.ВалютаУправленческогоУчета.Получить());

	// Соответствие имен полей в запросе и их представлений в отчете
	СтруктураПредставлениеПолей = Новый Структура("
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	ДоговорКонтрагентаВалютаВзаиморасчетов,
	|	Сделка,
	|	Сумма",
	"Контрагент",
	"Договор контрагента",
	"Валюта взаиморасчетов",
	"Сделка",
	"Сумма в валюте упр. учета");
	
	ТекстПоляКатегорий = "";
	ТекстПоляСвойств = "";
	
	Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда
		
		ТаблицаПолей = Новый ТаблицаЗначений;
		ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и
		                                               // категории. Используется в условии соединения с регистром сведений,
		                                               // хранящим значения свойств или категорий
		ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
		ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
	//	ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории.
		                                               // Не используется.
		ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта
		
		СтрокаТаблицы = ТаблицаПолей.Добавить();
		СтрокаТаблицы.ПутьКДанным = "ДоговорКонтрагента.Владелец";
		СтрокаТаблицы.Представление = "Контрагент";
		СтрокаТаблицы.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты;

		ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, Текст, СтруктураПредставлениеПолей, 
				ОбщийОтчет.мСоответствиеНазначений, ОбщийОтчет.ПостроительОтчета.Параметры
				,, ТекстПоляКатегорий, ТекстПоляСвойств,,,,,,ОбщийОтчет.мСтруктураДляОтбораПоКатегориям);

	КонецЕсли;

	ОбщийОтчет.ПостроительОтчета.Текст = Текст;
		
	Если ОбщийОтчет.ИспользоватьСвойстваИКатегории = Истина Тогда

		УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ОбщийОтчет.ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, ОбщийОтчет.мСоответствиеНазначений, СтруктураПредставлениеПолей);

	КонецЕсли;

	Если ОбщийОтчет.Показатели.Найти("Сумма", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("Сумма", "Сумма в " + Константы.ВалютаУправленческогоУчета.Получить(), Ложь, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	
	МассивОтбора=Новый Массив;
	МассивОтбора.Добавить("ВидВзаиморасчетов");
	ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ОбщийОтчет.ПостроительОтчета);
	ОчиститьДополнительныеПоляПостроителя(ОбщийОтчет.ПостроительОтчета);
	ЗаполнитьОтбор(МассивОтбора, ОбщийОтчет.ПостроительОтчета);
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	
	ОбщийОтчет.ПостроительОтчета.ИзмеренияСтроки.Добавить("Контрагент");


КонецПРоцедуры

Процедура СформироватьОтчет(Диаграмма) Экспорт
	ОбщийОтчет.СформироватьОтчет(Диаграмма);
КонецПроцедуры

// Настраивает отчет для параметрического вызова
//
// Параметры
//  СтруктураПараметров  – Структура, Соответсвие – содержит список параметров:
//	ДатаНач,
//	ДатаКон,
//	ИмяРегистра,
Процедура Настроить(СтруктураПараметров) Экспорт
	
	ВидЗадолженности=СтруктураПараметров["ВидЗадолженности"];
	ЗаполнитьНачальныеНастройки();
	ОбщийОтчет.Настроить(СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Возвращает основную форму отчета
//
// Параметры
//  Нет.
//
// Возвращаемое значение:
//   основная форма отчета
//
Функция ПолучитьОсновнуюФорму() Экспорт

	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;

КонецФункции // ПолучитьОсновнуюФорму()

ОбщийОтчет.мРежимВводаПериода = 1;
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
